object(ClassA)#1 (1) {
  ["val"]=>
  NULL
}
int(1)
object(ClassA)#1 (1) {
  ["val"]=>
  NULL
}
int(1)
object(ClassA)#1 (1) {
  ["val"]=>
  int(1)
}
string(3) "val"
int(2)
object(ClassA)#1 (1) {
  ["val"]=>
  int(2)
}

Notice: Undefined variable: val in %s/test/slow/assignment/1703.php on line 19
NULL
int(2)