object(A)#1 (1) {
  ["a"]=>
  int(1)
}
object(A)#1 (0) {
}
object(A)#1 (1) {
  ["a"]=>
  int(2)
}
object(A)#1 (2) {
  ["a"]=>
  int(2)
  ["b"]=>
  int(3)
}
object(A)#1 (1) {
  ["a"]=>
  int(2)
}
object(A)#1 (1) {
  ["a"]=>
  int(2)
}
object(A)#1 (2) {
  ["a"]=>
  int(2)
  ["b"]=>
  int(3)
}
object(A)#1 (0) {
}
