Warning: Cannot access property on non-object in %s/test/slow/reference/1097.php on line 4
NULL
array(1) {
  [0]=>
  object(stdClass)#1 (1) {
    ["foo"]=>
    array(1) {
      ["a"]=>
      array(1) {
        ["b"]=>
        int(5)
      }
    }
  }
}
object(stdClass)#1 (1) {
  ["foo"]=>
  array(1) {
    [1]=>
    object(stdClass)#2 (1) {
      ["prop"]=>
      NULL
    }
  }
}
object(stdClass)#3 (1) {
  ["foo"]=>
  array(1) {
    [1]=>
    object(stdClass)#4 (1) {
      ["prop"]=>
      NULL
    }
  }
}
object(stdClass)#5 (1) {
  ["foo"]=>
  array(1) {
    [1]=>
    object(stdClass)#6 (1) {
      ["prop"]=>
      &NULL
    }
  }
}
object(stdClass)#7 (1) {
  ["foo"]=>
  array(1) {
    [1]=>
    object(stdClass)#8 (1) {
      ["prop"]=>
      NULL
    }
  }
}