A::__get y
string(1) "y"
A::__get x
string(1) "x"
A::__get y
string(1) "y"
A::__get x
string(1) "x"
A::__get x
A::__set x, 1
A::__get y
A::__set y, 2
object(A)#1 (0) {
}
A::__get x

Notice: Increment on string 'x' in %s/test/quick/properties3.php on line %d
A::__set x, y
A::__get y

Notice: Increment on string 'y' in %s/test/quick/properties3.php on line %d
A::__set y, z
object(A)#1 (0) {
}
B::__get x
B::__get y
object(B)#2 (2) {
  ["x":"B":private]=>
  int(1)
  ["y"]=>
  int(2)
}
B::__get x

Notice: Increment on string 'x' in %s/test/quick/properties3.php on line %d
B::__get y

Notice: Increment on string 'y' in %s/test/quick/properties3.php on line %d
object(B)#2 (2) {
  ["x":"B":private]=>
  string(1) "y"
  ["y"]=>
  string(1) "z"
}
object(C)#3 (2) {
  ["x":"C":private]=>
  int(1)
  ["y"]=>
  int(2)
}
object(C)#3 (2) {
  ["x":"C":private]=>
  int(1)
  ["y"]=>
  int(1)
}

Notice: Undefined property: D::$y in %s/test/quick/properties3.php on line %d
NULL
NULL
object(D)#4 (2) {
  ["x":"D":private]=>
  int(1)
  ["y"]=>
  int(2)
}
object(D)#4 (2) {
  ["x":"D":private]=>
  int(1)
  ["y"]=>
  int(2)
}
object(D)#4 (2) {
  ["x":"D":private]=>
  int(1)
  ["y"]=>
  int(1)
}
