{
    "preamble": "",
    "consts": [
    ],
    "funcs": [
        {
            "name": "ctype_alnum",
            "desc": "Checks if all of the characters in the provided string, text, are alphanumeric. In the standard C locale letters are just [A-Za-z].",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is either a letter or a digit, FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_alpha",
            "desc": "Checks if all of the characters in the provided string, text, are alphabetic. In the standard C locale letters are just [A-Za-z] and ctype_alpha() is equivalent to (ctype_upper($text) || ctype_lower($text)) if $text is just a single character, but other languages have letters that are considered neither upper nor lower case.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is a letter from the current locale, FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_cntrl",
            "desc": "Checks if all of the characters in the provided string, text, are control characters. Control characters are e.g. line feed, tab, escape.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is a control character from the current locale, FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_digit",
            "desc": "Checks if all of the characters in the provided string, text, are numerical.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in the string text is a decimal digit, FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_graph",
            "desc": "Checks if all of the characters in the provided string, text, creates visible output.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is printable and actually creates visible output (no white space), FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_lower",
            "desc": "Checks if all of the characters in the provided string, text, are lowercase letters.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is a lowercase letter in the current locale."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_print",
            "desc": "Checks if all of the characters in the provided string, text, are printable.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text will actually create output (including blanks). Returns FALSE if text contains control characters or characters that do not have any output or control function at all."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_punct",
            "desc": "Checks if all of the characters in the provided string, text, are punctuation character.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is printable, but neither letter, digit or blank, FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_space",
            "desc": "Checks if all of the characters in the provided string, text, creates whitespace.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text creates some sort of white space, FALSE otherwise. Besides the blank character this also includes tab, vertical tab, line feed, carriage return and form feed characters."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_upper",
            "desc": "Checks if all of the characters in the provided string, text, are uppercase characters.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is an uppercase letter in the current locale."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        },
        {
            "name": "ctype_xdigit",
            "desc": "Checks if all of the characters in the provided string, text, are hexadecimal 'digits'.",
            "flags": [
            ],
            "return": {
                "type": "Boolean",
                "desc": "Returns TRUE if every character in text is a hexadecimal 'digit', that is a decimal digit or a character from [A-Fa-f] , FALSE otherwise."
            },
            "args": [
                {
                    "name": "text",
                    "type": "Variant",
                    "desc": "The tested string."
                }
            ]
        }
    ],
    "classes": [
    ]
}