object(A)#2 (2) {
  ["a"]=>
  NULL
  ["b"]=>
  NULL
}
object(A)#2 (2) {
  ["a"]=>
  int(1)
  ["b"]=>
  &int(1)
}
object(A)#2 (3) {
  ["a"]=>
  int(1)
  ["b"]=>
  &int(1)
  ["c"]=>
  int(3)
}
object(A)#2 (3) {
  ["a"]=>
  int(2)
  ["b"]=>
  int(2)
  ["c"]=>
  &int(2)
}
